; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image0 - mode
	infrared4 - mode
	infrared3 - mode
	thermograph1 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 infrared4)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared3)
	(supports instrument2 infrared4)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared4)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared4)
	(supports instrument8 thermograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument9 infrared3)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 spectrograph2)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
)
(:goal (and
	(pointing satellite2 Phenomenon14)
	(have_image Phenomenon3 spectrograph2)
	(have_image Star6 thermograph1)
	(have_image Phenomenon7 thermograph1)
	(have_image Star9 infrared3)
	(have_image Star10 infrared3)
	(have_image Phenomenon11 thermograph1)
	(have_image Planet12 infrared4)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 image0)
	(have_image Star15 spectrograph2)
	(have_image Star16 image0)
	(have_image Planet17 image0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 13
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 13
3. (turn_to satellite4 groundstation1 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 13
4. (calibrate satellite4 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 13
5. (turn_to satellite4 phenomenon11 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 13
6. (take_image satellite4 phenomenon11 instrument10 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 1 of 13
7. (turn_to satellite4 phenomenon13 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon13)
   goals met: 1 of 13
8. (take_image satellite4 phenomenon13 instrument10 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 2 of 13
9. (turn_to satellite4 phenomenon3 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon3)
   goals met: 2 of 13
10. (take_image satellite4 phenomenon3 instrument10 spectrograph2)
   added: (have_image phenomenon3 spectrograph2)
   goals met: 3 of 13
11. (turn_to satellite4 phenomenon7 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 phenomenon7)
   goals met: 3 of 13
12. (take_image satellite4 phenomenon7 instrument10 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 4 of 13
13. (turn_to satellite4 star15 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star15)
   goals met: 4 of 13
14. (take_image satellite4 star15 instrument10 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 5 of 13
15. (turn_to satellite4 star6 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star6)
   goals met: 5 of 13
16. (take_image satellite4 star6 instrument10 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 6 of 13
17. (turn_to satellite2 phenomenon14 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon14)
   goals met: 7 of 13
18. (turn_to satellite1 groundstation0 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation0)
   goals met: 7 of 13
19. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 7 of 13
20. (turn_to satellite1 phenomenon14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon14)
   goals met: 7 of 13
21. (take_image satellite1 phenomenon14 instrument2 image0)
   added: (have_image phenomenon14 image0)
   goals met: 8 of 13
22. (turn_to satellite1 planet12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet12)
   goals met: 8 of 13
23. (take_image satellite1 planet12 instrument2 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 9 of 13
24. (turn_to satellite1 planet17 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet17)
   goals met: 9 of 13
25. (take_image satellite1 planet17 instrument2 image0)
   added: (have_image planet17 image0)
   goals met: 10 of 13
26. (turn_to satellite1 star10 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star10)
   goals met: 10 of 13
27. (take_image satellite1 star10 instrument2 infrared3)
   added: (have_image star10 infrared3)
   goals met: 11 of 13
28. (turn_to satellite1 star16 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star16)
   goals met: 11 of 13
29. (take_image satellite1 star16 instrument2 image0)
   added: (have_image star16 image0)
   goals met: 12 of 13
30. (turn_to satellite1 star9 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star9)
   goals met: 12 of 13
31. (take_image satellite1 star9 instrument2 infrared3)
   added: (have_image star9 infrared3)
   goals met: 13 of 13
